Revit 2027 API
Application.CurrentUsersAddinsDataFolderPath Property
 Path to AddinsData folder for the current user.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string CurrentUsersAddinsDataFolderPath { get; }
Public ReadOnly Property CurrentUsersAddinsDataFolderPath As String
	Get
public:
property String^ CurrentUsersAddinsDataFolderPath {
	String^ get ();
}
member CurrentUsersAddinsDataFolderPath : string with get
Property Value
String
Remarks
 Similar to C:\Users\[UserName]\AppData\Roaming\Autodesk\[ProductType]\[ReleaseName]\AddinsData
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace